# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00 # layer channel multiple
anchors:
  - [5,6, 8,14, 15,11]
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/320
    [-1, 1, Conv, [64, 3, 1]],

   [ -1, 1, Conv, [ 128, 3, 2 ] ],  # 3-P2/160
   [ -1, 1, Conv, [ 64, 1, 1 ] ],
   [ -2, 1, Conv, [ 64, 1, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ [ -1, -3, -5, -6 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 256, 1, 1 ] ],  #11

   [2, 1, PatchEmbed, [48, 2] ],
   [ -1, 1, SwinStage, [ 48, 2, 6, 7] ],
   [ -1, 1, PatchMerging, [ 96 ] ], # 14

   [-4, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-6, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 19-P3/80
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 1, 1]],  #28 /80

   [ 14, 1, SwinStage, [ 96, 2, 6, 7] ],  # 3
   [ -1, 1, PatchMerging, [ 192 ] ],   # 30 /40

   [-3, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-5, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 44 /40

   [ 30, 1, SwinStage, [ 192, 2, 6, 7] ],  # 3
   [ -1, 1, PatchMerging, [ 384 ] ],   # 46 /20

   [ -3, 1, MP, [ ] ],
   [ -1, 1, Conv, [ 512, 1, 1 ] ],
   [ -5, 1, Conv, [ 512, 1, 1 ] ],
   [ -1, 1, Conv, [ 512, 3, 2 ] ],
   [ [ -1, -3], 1, Concat, [ 1 ] ],  # 51-P5/32
   [ -1, 1, Conv, [ 256, 1, 1 ] ],
   [ -2, 1, Conv, [ 256, 1, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ [ -1, -3, -5, -6 ], 1, Concat, [ 1 ] ],
   [-1, 1, Conv, [512, 1, 1]],
   [ -1, 1, Conv, [ 1024, 1, 1 ] ], #60

   [-1, 1, SPPF, [1024, 5]],  # 61
 ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [44, 1, Conv, [512, 1, 1]],
   [[-1, -2, ], 1, Concat, [1]],  # cat backbone P4   40

   [ -1, 1, Conv, [ 512, 1, 1 ] ],
   [ -2, 1, Conv, [ 512, 1, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ -1, 1, Conv, [ 256, 3, 1 ] ],
   [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 512, 1, 1 ] ], #73

   [ -1, 1, Conv, [ 256, 1, 1 ] ],
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ 28, 1, Conv, [ 256, 1, 1 ] ], # route backbone P3   80
   [ [ -1, -2 ], 1, Concat, [ 1 ] ],

   [ -1, 1, Conv, [ 256, 1, 1 ] ],
   [ -2, 1, Conv, [ 256, 1, 1 ] ],
   [ -1, 1, Conv, [ 128, 3, 1 ] ],
   [ -1, 1, Conv, [ 128, 3, 1 ] ],
   [ -1, 1, Conv, [ 128, 3, 1 ] ],
   [ -1, 1, Conv, [ 128, 3, 1 ] ],
   [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 256, 1, 1 ] ], # 85    80

   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ 11, 1, Conv, [ 128, 1, 1 ] ], # route backbone P3   80
   [ [ -1, -2 ], 1, Concat, [ 1 ] ],

   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -2, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1 ] ], # 97    80

   [97, 1, PatchEmbed, [96, 2] ],
   [ -1, 1, SwinBiCBAM, [ 96, 2, 6, 7] ],  # 101   80  87
   [ -1, 1, PatchMerging, [ 192 ] ],
   [ -1, 1, SwinBiCBAM, [ 192, 2, 6, 7] ],#  40

   [[97, 85, 99, 101], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)1
  ]
